===
namespace
===

namespace demo;

---

(source
    (namespace
        name: (ident)))

===
record: 0
===

def Model record end

---

(source
    (def_record
        name: (ident)))

===
record: 1
===

def Model record
    name String;
    end

---

(source
    (def_record
        name: (ident)
        (components
            (component
                name: (ident)
                type: (ident)))))

===
record: 2
===

def Model record
    name String;
    item String;
    end

---

(source
    (def_record
        name: (ident)
        (components
            (component
                name: (ident)
                type: (ident))
            (component
                name: (ident)
                type: (ident)))))

===
template-0
===

templ m Model do end

---

(source
    (def_templ
        var: (ident)
        type: (ident)))


===
template-1
===

templ m Model do
    [div]
    end

---

(source
    (def_templ
        var: (ident)
        type: (ident)
        (body
            (element tag: (ident)))))

===
template-2
===

templ m Model do
    [div [p]]
    end

---

(source
    (def_templ
        var: (ident)
        type: (ident)
        (body
            (element tag: (ident)
                (elements
                    (element tag: (ident)))))))

===
template-3
===

templ m Model do
    [div]
    [div]
    end

---

(source
    (def_templ
        var: (ident)
        type: (ident)
        (body
            (element tag: (ident))
            (element tag: (ident)))))
