===
namespace
===

namespace demo;

---

(source
    (namespace
        name: (ident)))

===
record: 0
===

def Model record end

---

(source
    (def_record
        name: (ident)))

===
record: 1
===

def Model record
    name String;
    end

---

(source
    (def_record
        name: (ident)
        (components
            (component
                name: (ident)
                type: (ident)))))

===
record: 2
===

def Model record
    name String;
    item String;
    end

---

(source
    (def_record
        name: (ident)
        (components
            (component
                name: (ident)
                type: (ident))
            (component
                name: (ident)
                type: (ident)))))

===
template: 0
===

template m Model do end

---

(source
    (def_template
        var: (ident)
        type: (ident)))

