===
namespace
===

// demo
namespace demo;

---

(source
    (comment)
    (namespace
        name: (ident)))

===
record
===

/// Model
def Model record end

---

(source
    (comment)
    (def_record
        name: (ident)))

===
template
===

// template
templ m Model do end

---

(source
    (comment)
    (def_templ
        var: (ident)
        type: (ident)))

===
multi line
===

// demo line 1
/// line 2
// line 3
namespace demo;

---

(source
    (comment)
    (namespace
        name: (ident)))

