===
empty
===

[div]

---

(source (element tag: (ident)))

===
attr-1
===

[div (= k1 value)]

---

(source
    (element
        tag: (ident)
        (attrs
            (list_lit
                value: (sym)
                value: (ident)
                value: (ident)))))

===
attr-2
===

[div
    (= k1 true)
    (= k2 false)
    (= k3 100)
    (= k4 "string")
    (= k5 (m.foo))
    ]

---

(source
    (element
        tag: (ident)
        (attrs
            (list_lit
                value: (sym)
                value: (ident)
                value: (bool_lit))
            (list_lit
                value: (sym)
                value: (ident)
                value: (bool_lit))
            (list_lit
                value: (sym)
                value: (ident)
                value: (int_lit))
            (list_lit
                value: (sym)
                value: (ident)
                value: (str_lit))
            (list_lit
                value: (sym)
                value: (ident)
                value: (list_lit value:
                    (field_access
                        object: (ident)
                        field: (ident)))))))

===
attr-3
===

[div
    (= display grid
        ; gap 10
        ; auto-flow column
        )
    ]

---

(source
    (element tag: (ident)
        (attrs
            (list_lit
                value: (sym)
                value: (ident)
                value: (ident)
                value: (pipe (ident) (int_lit))
                value: (pipe (ident) (ident))
                ))))

===
attr-4
===

[div
    (= display grid
        ; gap 10
        ; (auto-flow column)
        )
    ]

---

(source
    (element tag: (ident)
        (attrs
            (list_lit
                value: (sym)
                value: (ident)
                value: (ident)
                value: (pipe (ident) (int_lit))
                value: (pipe (list_lit value: (ident) value: (ident)))
                ))))

===
keyword
===

[:script]

---

(source (element tag: (kwd_lit name: (ident))))

===
elements
===

[div]
[div]

---
(source
    (element tag: (ident))
    (element tag: (ident)))

===
nesting-element
===

[div [p]]

---

(source
    (element
        tag: (ident)
        (children
            (element tag: (ident)))))

===
nesting-element-2
===

[div
   [p]
   [p [span]]
   ]

---

(source
    (element
        tag: (ident)
        (children
            (element tag: (ident))
            (element tag: (ident)
                (children
                    (element tag: (ident)))))))


===
nesting-expr
===

[div (foo)]

---

(source
    (element tag: (ident)
        (children
            (list_lit value: (ident)))))

===
plain-text-1
===

[div foo]

---

(source
    (element tag: (ident)
        (children)))
