===
empty
===

[div]

---

(source (element tag: (ident)))

===
attr-1
===

[div k1=value]

---

(source
    (element
        tag: (ident)
        (attrs (attr
            key: (ident)
            value: (text)))))

===
attr-2
===

[div
    k1=value
    k2=value
    ]

---

(source
    (element
        tag: (ident)
        (attrs
            (attr
                key: (ident)
                value: (text))
            (attr
                key: (ident)
                value: (text)))))

===
keyword
===

[:script]

---

(source (element tag: (kwd_lit name: (ident))))

===
elements
===

[div]
[div]

---
(source
    (element tag: (ident))
    (element tag: (ident)))

===
nesting-element
===

[div [p]]

---

(source
    (element
        tag: (ident)
        (children
            (element tag: (ident)))))

===
nesting-element-2
===

[div
   [p]
   [p [span]]
   ]

---

(source
    (element
        tag: (ident)
        (children
            (element tag: (ident))
            (element tag: (ident)
                (children
                    (element tag: (ident)))))))


===
nesting-expr
===

[div (foo)]

---

(source
    (element tag: (ident)
        (children
            (list_lit value: (ident)))))
