===
ident
===

(foo)

---

(source (list_lit (ident)))

===
number
===

(100)

---

(source (list_lit (int_lit)))

===
field
===

(m.foo)

---

(source
    (list_lit
        value: (field_access
            object: (ident)
            field: (ident))))

===
string-1
===

('')

---

(source (list_lit (str_lit)))

===
string-2
===

("")

---

(source (list_lit (str_lit)))

===
string-3
===

('foo')

---

(source (list_lit (str_lit)))

===
string-4
===

("foo")

---

(source (list_lit (str_lit)))

===
string-5
===

("\a")

---

(source (list_lit value: (str_lit)))

===
string-6
:error
===

("\[")

===
string-7
===

("\bfoo")

---

(source
    (list_lit value:
        (str_lit)))

===
string-8
===

("foo\[")

---

(source
    (list_lit value:
        (str_lit)))

===
bool-1
===

(true)

---

(source (list_lit (bool_lit)))

===
bool-2
===

(false)

---

(source (list_lit (bool_lit)))

===
each-1
:error
===

(:each (in m.items i item))

===
each-2
:error
===

(:each (in m.items item))

===
each-3
===

(:each (in m.items i item)
    [div (i) (item)]
    )

---

(source
    (list_lit
        value: (kwd_lit name: (ident))
        value: (list_lit
                    value: (ident)
                    value: (field_access object: (ident) field: (ident))
                    value: (ident)
                    value: (ident))
        value: (element tag: (ident)
            (children
                (list_lit value: (ident))
                (list_lit value: (ident))))))

===
operator-1
===

(+ 1 m b)

---

(source
    (list_lit
        value: (sym)
        value: (int_lit)
        value: (ident)
        value: (ident)))

===
operator-2
===

(- 1 m)

---

(source
    (list_lit
        value: (sym)
        value: (int_lit)
        value: (ident)))

===
operator-3
===

(* 1 2)

---

(source
    (list_lit
        value: (sym)
        value: (int_lit)
        value: (int_lit)))

===
operator-4
===

(/ a b)

---

(source
    (list_lit
        value: (sym)
        value: (ident)
        value: (ident)))

===
logical-1
===

(:and true true)

---

(source
    (list_lit
        value: (kwd_lit name: (ident))
        value: (bool_lit)
        value: (bool_lit)))

===
logical-2
===

(:or false true)

---

(source
    (list_lit
        value: (kwd_lit name: (ident))
        value: (bool_lit)
        value: (bool_lit)))

===
logical-3
===

(:not true)

---

(source
    (list_lit
        value: (kwd_lit name: (ident))
        value: (bool_lit)))

===
keyword
===

(:and)

---

(source
    (list_lit
        value: (kwd_lit name: (ident))))

===
nested expr
===

(:and true (+ 1 3))

---

(source
    (list_lit
        value: (kwd_lit name: (ident))
        value: (bool_lit)
        value:
            (list_lit
                value: (sym)
                value: (int_lit)
                value: (int_lit))))

===
string-template-1
:skip
===

("\(true)")

---

(source
    (list_lit value: (str_lit templ: (list_lit value: (bool_lit)))))

===
string-template-2
:skip
===

("foo\(100)")

---

(source
    (list_lit value: (str_lit templ: (list_lit value: (int_lit)))))

===
escape-1
:skip
===

\()

---

(source (text))

===
escape-2
:skip
===

\[]

---

(source (text))
