===
ident
===

(foo)

---

(source (expr (ident)))

===
number
===

(100)

---

(source (expr (literal_int)))

===
field
===

(m.foo)

---

(source
    (expr
        (field_access
            object: (ident)
            field: (ident))))

===
string-1
===

('')

---

(source (expr (literal_str)))

===
string-2
===

("")

---

(source (expr (literal_str)))

===
string-3
===

('foo')

---

(source (expr (literal_str)))

===
string-4
===

("foo")

---

(source (expr (literal_str)))
